public/InterfaceStats_MW.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <header xmlns="xmlapi_1.0">
         <security>
            <user>C12285</user>
            <password hashed="false">Peru2018#</password>
         </security>
         <requestID>aquiroga:0001</requestID>
      </header>
   </SOAP:Header>

   <SOAP:Body>
      <find xmlns="xmlapi_1.0">
         <fullClassName>ethernetequipment.AggrMaintTxStatsLogRecord</fullClassName>
         <filter>
           <and>
            <not>
             <or>
              <wildcard name="displayedName" value="Channel%"/>
              <wildcard name="displayedName" value="system%"/>
              <wildcard name="displayedName" value="loopback%"/>
             </or>
            </not>
            <and>
             <notEqual name="aggrMaintTxTTOPeriodic" value="0"/>
            </and>
          </and>
         </filter>
         <resultFilter>
            <attribute>monitoredObjectSiteName</attribute>
            <attribute>displayedName</attribute>
            <attribute>aggrMaintTxTTO</attribute>
            <attribute>aggrMaintTxTTOPeriodic</attribute>
            <attribute>periodicTime</attribute>
            <attribute>timeCaptured</attribute>
            <children/>
         </resultFilter>
      </find>
   </SOAP:Body>

</SOAP:Envelope>
